//12. Дано ціле число n(1< n < 4), яке визначає порядковий номер кварталу року(січень, лютий, березень — І квартал і т.д.).
//За вказаним значенням n надрукувати перелік місяців, які належать до цього кварталу.

#include <iostream>
#include<cmath>

using namespace std;
int main()
{
	setlocale(LC_CTYPE, "ukr");
	int n;
	cout << "Введiть число 2 або число 3: ";
	cin >> n;
	if (n = 1)
		cout << "квітень, травень, червень";
	else cout << "липень, серпень, вересень";

	return 0;
}
